of60/tutorials/rheoMultiRegionFoam/calibrator/0/polymer/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 200;

boundaryField
{
    
    p_inlet
    {
        type            fixedValue;
        value           uniform 200;
    }
    
    p_outlet
    {
        type            zeroGradient;
    }
    
    p_down
    {
        type            zeroGradient;
    }
    
    "(bottom|top)"  
    {
        type             empty;
    }
    
    inter.polymer
    {   
        type                    coupledT;
        nbrFieldName            "T";
        isContactResistance     false;
        hres                    1;
        value                   uniform 200;
    }
}

// ************************************************************************* //
