of60/tutorials/rheoMultiRegionFoam/calibrator/0/polymer/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/fluid";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (0.01 0 0);

boundaryField
{
    
    p_inlet
    {
        type            fixedValue;
        value           uniform (0.01 0 0);
    }
    
    p_outlet
    {
        type            zeroGradient;
    }
    
    p_down
    {
        type            fixedValue;
        value           uniform (0.01 0 0);
    }
      
    inter.polymer
    {
        type            fixedValue;
        value           uniform (0.01 0 0);
    }
    
    "(bottom|top)"  
    {
        type             empty;
    }
    
    
}

// ************************************************************************* //
