of60/tutorials/rheoMultiRegionFoam/calibrator/system/calibrator/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/metal";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(T.*)"
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-6;
        relTol           0;
    }

}

PIMPLE
{
    nNonOrthogonalCorrectors 0;
}

// ************************************************************************* //
