of60/tutorials/rheoMultiRegionFoam/calibrator/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

coupledSolvers
{
  T
  {
    solveCoupledT true;
     
    saveSystem true;
    robustSumCheck  true;
    updatePrecondFrequency 10000;  
    updateMatrixCoeffs false;  
  }

}


PIMPLE
{
  nOuterCorrectors    1;
}

// ************************************************************************* //
